TOKEN = '5796252559:AAGvNlYwUmWheahyV4f3hOcdBzamWkEfETY'
bot_address = 'https://t.me/oleza034_currency_bot'

help_txt = 'Чтобы конвертировать валюту, наберите запрос в формате:\n' \
            '<меняемая валюта> <получаемая валюта> <количество исходной валюты>.\n' \
            'Например: доллар рубль 50\nКоманды:\n' \
            '/help: получить эту справку\n/values: список допустимых валют'

keys = {
    'рубль': 'RUR',
    'доллар': 'USD',
    'евро': 'EUR',
    'биткоин': 'BTC',
    'эфириум': 'ETH',
    'крона': 'SEK',
    'фунт': 'GBP'
}